j20-immigration/j20-immigration.org
#+OPTIONS: broken-links:t todo:nil
#+AUTHOR: Hawaii J20
#+hugo_base_dir: /home/dk/Public/projects/958-web-site/public-node/j20-immigration/
#+hugo_auto_set_lastmod: t
** DONE Did my Senator support the Ho`okipa Bill?
   CLOSED: [2018-07-01 Sun 14:16]
   :PROPERTIES:
   :EXPORT_FILE_NAME: state-senate
   :EXPORT_AUTHOR: "Hawaii J20"
   :EXPORT_HUGO_MENU: :menu "main"
   :END:

*** Question:
Did my State Senator support the Ho`okipa Bill during the 2018 legislative
session?

*** Background:

In the following table, the marks in the Ho`ikipa column have these meanings:
=++= introduced the bill and voted aye; =+= voted aye; =+/-= voted aye with
reservations; =-= voted nay. Note that senator names are linked to legislative
web sites with contact information.

Or, [[file:/qgis2web_2018_07_02-16_28_17_275091/index.html][view a map of Senate districts]], where bluer indicates stronger support for
the Ho`okipa bill and redder is the opposite.

| Dist. | Senator                    | Ho`okipa | Party | Areas Represented                                                                                            |
|-------+----------------------------+----------+-------+--------------------------------------------------------------------------------------------------------------|
|     1 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=kkahele&year=2018][Kaiali‘i Kahele]]            | +        | Dem   | Hilo                                                                                                         |
|     2 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=ruderman&year=2018][Russell E. Ruderman]]        | +        | Dem   | Puna, Ka`u                                                                                                   |
|     3 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=green&year=2018][Josh Green]]                 | +        | Dem   | Kona, Ka`u                                                                                                   |
|     4 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=inouye&year=2018][Lorraine Inouye]]            | +        | Dem   | Hilo, Hamakua, Kohala, Waimea, Waikoloa, Kona                                                                |
|     5 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=keithagaran&year=2018][Gilbert S. C. Keith-Agaran]] | +        | Dem   | Wailuku, Waihe'e, Kahului                                                                                    |
|     6 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=baker&year=2018][Rosalyn Baker]]              | +        | Dem   | South and West Maui                                                                                          |
|     7 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=english&year=2018][J. Kalani English]]          | +        | Dem   | Kalawao, Hana, East and Upcountry Maui, Moloka`i, Lana`i and Kaho`olawe                                      |
|     8 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=kouchi&year=2018][Ronald D. Kouchi]]           | +        | Dem   | Kauai, Ni'ihau                                                                                               |
|     9 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=chang&year=2018][Stanley Chang]]              | ++       | Dem   | Honolulu, Hawai`i Kai, `Aina Haina, Wai`alae-Kahala, Diamond Head                                            |
|    10 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=ihara&year=2018][Les Ihara, Jr.]]             | +        | Dem   | Kaimuki, Kapahulu, Palolo, Maunalani Heights, St. Louis Heights, Mo`ili`ili, Ala Wai                         |
|    11 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=taniguchi&year=2018][Brian Taniguchi]]            | ++       | Dem   | Manoa, Makiki, Punchbowl, Papakolea                                                                          |
|    12 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=galuteria&year=2018][Brickwood Galuteria]]        | +        | Dem   | Kaka`ako, Ala Moana, Waikiki, McCully, Mo`ili`ili                                                            |
|    13 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=krhoads&year=2018][Karl Rhoads]]                | ++       | Dem   | Liliha, Palama, Iwilei, Kalihi, Nu`uanu, Pacific Heights, Pauoa, Lower Tantalus, Downtown                    |
|    14 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=nakashima&year=2018][Donna Mercado Kim]]          | +/-      | Dem   | Moanalua, `Aiea, Fort Shafter, Kalihi Valley, Halawa Valley                                                  |
|    15 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=wakai&year=2018][Glenn Wakai]]                | +        | Dem   | Kalihi, Mapunapuna, Airport, Salt Lake, Aliamanu, Foster Village, Hickam, Pearl Harbor                       |
|    16 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=harimoto&year=2018][Breene Harimoto]]            | +        | Dem   | Pearl City, Momilani, Pearlridge, `Aiea, Royal Summit, `Aiea Heights, Newtown, Waimalu, Halawa, Pearl Harbor |
|    17 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=nishihara&year=2018][Clarence K. Nishihara]]      | +        | Dem   | Waipahu, Pearl City, Crestview, Manana, Pacific Palisades                                                    |
|    18 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=kidani&year=2018][Michelle Kidani]]            | +        | Dem   | Mililani Town, Waipi`o Gentry, Waikele, Village Park, Royal Kunia                                            |
|    19 | Will Espero                | +        | Dem   | `Ewa Beach, `Ewa by Gentry, Ocean Pointe, `Ewa Villages, Iroquois Point                                      |
|    20 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=gabbard&year=2018][Mike Gabbard]]               | -        | Dem   | Makakilo, Kapolei, Kalaeloa, `Ewa, Waipahu                                                                   |
|    21 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=shimabukuro&year=2018][Maile Shimabukuro]]          | +        | Dem   | Kalaeloa, Honokai Hale, Ko `Olina, Nanakuli, Ma`ili, Wai`anae, Makaha, Makua                                 |
|    22 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=delacruz&year=2018][Donovan Dela Cruz]]          | +        | Dem   | Mililani Mauka, Waipi`o Acres, Wheeler, Wahiawa, Whitmore Village, Poamoho                                   |
|    23 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=riviere&year=2018][Gil Riviere]]                | -        | Dem   | Kunia, Schofield Barracks, Wahiawa, Waialua, Hale`iwa, Kahuku, La`ie, Ka`a`awa, Kane`ohe                     |
|    24 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=tokuda&year=2018][Jill N. Tokuda]]             | +        | Dem   | `Ahuimanu, He`eia, Kane`ohe, Kane`ohe MCAB                                                                   |
|    25 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=lthielen&year=2018][Laura Thielen]]              | +        | Dem   | Kailua, Lanikai, Enchanted Lake, Keolu Hills, Maunawili, Waimanalo, Hawai`i Kai, Portlock                    |

*** Answer:

Support for the 2018 Ho`okipa Bill was strong in the Senate, where it was
introduced by Senators Rhoads, Chang, and Taniguchi. Twenty-two senators
consistently voted for the bill. Senator Mercado Kim had reservations, and
Senators Gabbard and Riviere voted against the bill.


