j20-immigration/content/post/state-senate.md
+++
title = "Did my Senator support the Ho`okipa Bill?"
author = ["Hawaii J20"]
date = 2018-07-01T14:16:00-10:00
lastmod = 2018-08-04T18:04:09-10:00
draft = false
[menu.main]
  weight = 2012
  identifier = "did-my-senator-support-the-ho-okipa-bill"
+++

## Question: {#question}

Did my State Senator support the Ho\`okipa Bill during the 2018 legislative
session?


## Background: {#background}

In the following table, the marks in the Ho\`ikipa column have these meanings:
`++` introduced the bill and voted aye; `+` voted aye; `+/-` voted aye with
reservations; `-` voted nay. Note that senator names are linked to legislative
web sites with contact information.

Or, [view a map of Senate districts](/qgis2web_2018_07_02-16_28_17_275091/index.html), where bluer indicates stronger support for
the Ho\`okipa bill and redder is the opposite.

| Dist. | Senator                                                                                                   | Ho\`okipa | Party | Areas Represented                                                                                              |
|-------|-----------------------------------------------------------------------------------------------------------|-----------|-------|----------------------------------------------------------------------------------------------------------------|
| 1     | [Kaiali‘i Kahele](https://www.capitol.hawaii.gov/memberpage.aspx?member=kkahele&year=2018)                | +         | Dem   | Hilo                                                                                                           |
| 2     | [Russell E. Ruderman](https://www.capitol.hawaii.gov/memberpage.aspx?member=ruderman&year=2018)           | +         | Dem   | Puna, Ka\`u                                                                                                    |
| 3     | [Josh Green](https://www.capitol.hawaii.gov/memberpage.aspx?member=green&year=2018)                       | +         | Dem   | Kona, Ka\`u                                                                                                    |
| 4     | [Lorraine Inouye](https://www.capitol.hawaii.gov/memberpage.aspx?member=inouye&year=2018)                 | +         | Dem   | Hilo, Hamakua, Kohala, Waimea, Waikoloa, Kona                                                                  |
| 5     | [Gilbert S. C. Keith-Agaran](https://www.capitol.hawaii.gov/memberpage.aspx?member=keithagaran&year=2018) | +         | Dem   | Wailuku, Waihe'e, Kahului                                                                                      |
| 6     | [Rosalyn Baker](https://www.capitol.hawaii.gov/memberpage.aspx?member=baker&year=2018)                    | +         | Dem   | South and West Maui                                                                                            |
| 7     | [J. Kalani English](https://www.capitol.hawaii.gov/memberpage.aspx?member=english&year=2018)              | +         | Dem   | Kalawao, Hana, East and Upcountry Maui, Moloka\`i, Lana\`i and Kaho\`olawe                                     |
| 8     | [Ronald D. Kouchi](https://www.capitol.hawaii.gov/memberpage.aspx?member=kouchi&year=2018)                | +         | Dem   | Kauai, Ni'ihau                                                                                                 |
| 9     | [Stanley Chang](https://www.capitol.hawaii.gov/memberpage.aspx?member=chang&year=2018)                    | ++        | Dem   | Honolulu, Hawai\`i Kai, \`Aina Haina, Wai\`alae-Kahala, Diamond Head                                           |
| 10    | [Les Ihara, Jr.](https://www.capitol.hawaii.gov/memberpage.aspx?member=ihara&year=2018)                   | +         | Dem   | Kaimuki, Kapahulu, Palolo, Maunalani Heights, St. Louis Heights, Mo\`ili\`ili, Ala Wai                         |
| 11    | [Brian Taniguchi](https://www.capitol.hawaii.gov/memberpage.aspx?member=taniguchi&year=2018)              | ++        | Dem   | Manoa, Makiki, Punchbowl, Papakolea                                                                            |
| 12    | [Brickwood Galuteria](https://www.capitol.hawaii.gov/memberpage.aspx?member=galuteria&year=2018)          | +         | Dem   | Kaka\`ako, Ala Moana, Waikiki, McCully, Mo\`ili\`ili                                                           |
| 13    | [Karl Rhoads](https://www.capitol.hawaii.gov/memberpage.aspx?member=krhoads&year=2018)                    | ++        | Dem   | Liliha, Palama, Iwilei, Kalihi, Nu\`uanu, Pacific Heights, Pauoa, Lower Tantalus, Downtown                     |
| 14    | [Donna Mercado Kim](https://www.capitol.hawaii.gov/memberpage.aspx?member=nakashima&year=2018)            | +/-       | Dem   | Moanalua, \`Aiea, Fort Shafter, Kalihi Valley, Halawa Valley                                                   |
| 15    | [Glenn Wakai](https://www.capitol.hawaii.gov/memberpage.aspx?member=wakai&year=2018)                      | +         | Dem   | Kalihi, Mapunapuna, Airport, Salt Lake, Aliamanu, Foster Village, Hickam, Pearl Harbor                         |
| 16    | [Breene Harimoto](https://www.capitol.hawaii.gov/memberpage.aspx?member=harimoto&year=2018)               | +         | Dem   | Pearl City, Momilani, Pearlridge, \`Aiea, Royal Summit, \`Aiea Heights, Newtown, Waimalu, Halawa, Pearl Harbor |
| 17    | [Clarence K. Nishihara](https://www.capitol.hawaii.gov/memberpage.aspx?member=nishihara&year=2018)        | +         | Dem   | Waipahu, Pearl City, Crestview, Manana, Pacific Palisades                                                      |
| 18    | [Michelle Kidani](https://www.capitol.hawaii.gov/memberpage.aspx?member=kidani&year=2018)                 | +         | Dem   | Mililani Town, Waipi\`o Gentry, Waikele, Village Park, Royal Kunia                                             |
| 19    | Will Espero                                                                                               | +         | Dem   | \`Ewa Beach, \`Ewa by Gentry, Ocean Pointe, \`Ewa Villages, Iroquois Point                                     |
| 20    | [Mike Gabbard](https://www.capitol.hawaii.gov/memberpage.aspx?member=gabbard&year=2018)                   | -         | Dem   | Makakilo, Kapolei, Kalaeloa, \`Ewa, Waipahu                                                                    |
| 21    | [Maile Shimabukuro](https://www.capitol.hawaii.gov/memberpage.aspx?member=shimabukuro&year=2018)          | +         | Dem   | Kalaeloa, Honokai Hale, Ko \`Olina, Nanakuli, Ma\`ili, Wai\`anae, Makaha, Makua                                |
| 22    | [Donovan Dela Cruz](https://www.capitol.hawaii.gov/memberpage.aspx?member=delacruz&year=2018)             | +         | Dem   | Mililani Mauka, Waipi\`o Acres, Wheeler, Wahiawa, Whitmore Village, Poamoho                                    |
| 23    | [Gil Riviere](https://www.capitol.hawaii.gov/memberpage.aspx?member=riviere&year=2018)                    | -         | Dem   | Kunia, Schofield Barracks, Wahiawa, Waialua, Hale\`iwa, Kahuku, La\`ie, Ka\`a\`awa, Kane\`ohe                  |
| 24    | [Jill N. Tokuda](https://www.capitol.hawaii.gov/memberpage.aspx?member=tokuda&year=2018)                  | +         | Dem   | \`Ahuimanu, He\`eia, Kane\`ohe, Kane\`ohe MCAB                                                                 |
| 25    | [Laura Thielen](https://www.capitol.hawaii.gov/memberpage.aspx?member=lthielen&year=2018)                 | +         | Dem   | Kailua, Lanikai, Enchanted Lake, Keolu Hills, Maunawili, Waimanalo, Hawai\`i Kai, Portlock                     |


## Answer: {#answer}

Support for the 2018 Ho\`okipa Bill was strong in the Senate, where it was
introduced by Senators Rhoads, Chang, and Taniguchi. Twenty-two senators
consistently voted for the bill. Senator Mercado Kim had reservations, and
Senators Gabbard and Riviere voted against the bill.
